# SculptingFailures Properties

---
The BuiltInFailuresSculptingFailures type exposes the following members.
| Name| Description
---|---|---
| FaceSculptEditFailed|  Face Sculpt Edit failed.
| FaceSculptingFaceLoss|  The original sculpted face is lost.
Top
#### Reference
BuiltInFailuresSculptingFailures Class
Autodesk.Revit.DB Namespace